Documents/questioning-a-co-owner.org
#+Title: Doing research on what users would like to see
#+Date: 12th October 2021

* Recording 1
This recording is with PineappleFan, someone who will be, on a day-to-day basis, using the code I create in this EPQ, I asked them a question about what features they'd like to see, and I'll be working quite tightly with them and another co-owner later on in the process
[[file:research-recording-1.flac][The recording (flac)]]

Transcript (emphasis mine):
#+begin_quote
Me: Alright, hi pinea, can you introduce yourself?

Pinea: Hello, I am pineapple, I am a programmer and work with minion on different projects

Me: and I'm minion, I'm also known as Skyler, and *I'm going to ask pineapple a few questions about my EPQ project*, so pinea, we've talked a bit about my EPQ project. *What kind of features would you like to see in this kind of process manager**

Pinea: So, some of the main things which I guess others don't have is *integration with git: easy pushing, checking for updates, automatically starting back up and taking backups of that when needed and just easy environmental variables* would be great

Me: Ok, so you think you'd like *better ways of communicating with the services we use to host our code, and better ways of managing the production state* so variables and databases and stuff like that

Pinea: Exactly

Me: Alright great, and thank you
#+end_quote
