Documents/questioning-a-co-owner.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Doing research on what users would like to see</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">Doing research on what users would like to see</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org20cea66">Recording 1</a></li>
</ul>
</div>
</div>

<div id="outline-container-org20cea66" class="outline-2">
<h2 id="org20cea66">Recording 1</h2>
<div class="outline-text-2" id="text-org20cea66">
<p>
This recording is with PineappleFan, someone who will be, on a day-to-day basis, using the code I create in this EPQ, I asked them a question about what features they'd like to see, and I'll be working quite tightly with them and another co-owner later on in the process
<a href="research-recording-1.flac">The recording (flac)</a>
</p>

<p>
Transcript (emphasis mine):
</p>
<blockquote>
<p>
Me: Alright, hi pinea, can you introduce yourself?
</p>

<p>
Pinea: Hello, I am pineapple, I am a programmer and work with minion on different projects
</p>

<p>
Me: and I'm minion, I'm also known as Skyler, and <b>I'm going to ask pineapple a few questions about my EPQ project</b>, so pinea, we've talked a bit about my EPQ project. <b>What kind of features would you like to see in this kind of process manager*</b>
</p>

<p>
Pinea: So, some of the main things which I guess others don't have is <b>integration with git: easy pushing, checking for updates, automatically starting back up and taking backups of that when needed and just easy environmental variables</b> would be great
</p>

<p>
Me: Ok, so you think you'd like <b>better ways of communicating with the services we use to host our code, and better ways of managing the production state</b> so variables and databases and stuff like that
</p>

<p>
Pinea: Exactly
</p>

<p>
Me: Alright great, and thank you
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 12th October 2021</p>
</div>
</body>
</html>
